package com.xsavzh.pizzarecipes

class Utils {
    companion object {
        const val MARGARITA_TITLE = "Маргарита"
        const val MARGARITA_DESCRIPTION = "Пицца «Маргарита» — это классическая неаполитанская пицца: пышное тесто с хрустящей корочкой, томатное пюре, пряный базилик и тягучая моцарелла."
        const val MARGARITA_RECIPE = "Продукты, которые вам понадобятся:\n" +
                "\n" +
                "Вода – 125 мл\n" +
                "Соль – 1 чайная ложка\n" +
                "Дрожжи – 1 ¼ чайная ложка\n" +
                "Мука – 250 гр.\n" +
                "Оливковое масло – 1 столовая ложка\n" +
                "Томатный соус – 4 столовых ложки\n" +
                "Моцарелла – 100 гр.\n" +
                "Зеленый базилик – 8-9 листиков\n" +
                "Помидор – 1 шт.\n" +
                "Чтобы у вас получилась настоящая пицца «Маргарита», обязательно используйте моцареллу, как указано в рецепте. Рекомендуем выбрать специальную разновидность этого сыра для горячих блюд (моцарелла в виде привычных белых шариков в рассоле не подойдет). Если вы используете другой сорт сыра, у вас получится уже не «Маргарита», а совсем другое блюдо.\n" +
                "Секрет теста: как в Италии\n" +
                "Удачная пицца – это прежде всего вкусное тесто. Для его приготовления разведите дрожжи в 125 мл воды (желательно теплой) и оставьте их на 10 минут. Чтобы процесс брожения шел быстрее, можно добавить ложку сахара. Пока дрожжи набухают, пересыпьте муку в чашку и добавьте в нее соль. Налейте в муку дрожжевую смесь и хорошо перемешайте все с помощью вилки.\n" +
                "Затем начинайте месить тесто, тщательно собирая его кусочки со стенок посуды. Его можно пропускать между пальцев, складывать в разные стороны, чтобы сделать максимально однородным. Очень важно, чтобы тесто не стало сухим, оно должно оставаться чуть-чуть липким. Муку добавляйте совсем небольшими порциями. Когда тесто станет цельным, налейте в него оливковое масло и снова приступайте к перемешиванию.\n" +
                "Процесс перемешивания должен занять не менее 10 минут. Пожалуй, в этом и состоит главный секрет рецепта пиццы «Маргарита» на тонком тесте. Разминайте его ладонью, складывайте пополам и снова разминайте. Даже не добавляя муки, вы сможете сделать его гладким и эластичным. Затем накройте тесто влажным полотенцем и уберите его на полчаса в теплое место.\n" +
                "Начинка пиццы «Маргарита»\n" +
                "Рецепт начинки достаточно прост: помидор нужно нарезать тонкими колечками, а сыр –толстыми кусочками толщиной примерно 1 см. Тесто в классическом рецепте пиццы «Маргарита» должно быть толщиной около 3 мм. Чтобы получить круглую форму, раскатывайте тесто в разных направлениях. Добиться идеальной формы можно с помощью тарелки – просто обрежьте лишнее тесто по ее контуру. Затем основу для пиццы нужно переложить на пергамент (более простой вариант – сразу раскатывать на нем).\n" +
                "Соус для пиццы\n" +
                "На центральную часть теста выложите томатный соус для пиццы «Маргарита». Вы можете приготовить его самостоятельно, хорошо потушив помидоры и добавив к ним перец, травы и чеснок. Также можно использовать готовый соус или даже томатную пасту. Главное, чтобы консистенция была достаточно густой и не содержала лишней жидкости.\n" +
                "Затем распределите кусочки моцареллы по всей поверхности пиццы. Это позволит сыру соединить начинку с коржом. Сверху нужно выложить листочки базилика, кольца помидоров и еще несколько кусочков сыра.\n" +
                "Готовим, как в итальянской печи\n" +
                "Разогрейте духовку до максимальной температуры. Чтобы пицца «Маргарита» была похожа на классическую, которая приготовлена в печи, воспользуйтесь маленькой хитростью: предварительно, примерно на 10 минут поместите в горячую печь пустой противень. Это позволит ему хорошо прогреться и отдать свое тепло блюду. Выпекать пиццу нужно на самом нижнем уровне в течение 3-6 минут, а вынимать в тот момент, когда сыр начнет таять, но еще не потерял форму.\n" +
                "Дайте блюду немного остыть, посыпьте его оставшимися листочками базилика, разрежьте на части – и наслаждайтесь неповторимым вкусом классической итальянской пиццы!"

        const val CAPRICCIOSA_TITLE = "Капричоза"
        const val CAPRICCIOSA_DESCRIPTION = "Пицца капричоза — итальянская пицца, приготовленная из сыра моцарелла, запеченной ветчины, грибов, артишоков и помидоров."
        const val CAPRICCIOSA_RECIPE = "Соус для пиццы (получается ~ 450 миллилитров соуса)\n" +
                "лук: 1 (мелко нарезанный)\n" +
                "оливковое масло: 3 ст.л. \n" +
                "томатная паста: 3 ст.л. \n" +
                "томаты черри: 2 стакана\n" +
                "мелкий сахар: 1 ч.л.\n" +
                "красный винный уксус: 1 ст.л.\n" +
                "базилик: 4-5 веточек\n" +
                "Для классического теста для пиццы (получается 3 порции теста, из которых будем выпекать 3 пиццы диаметром около 30 см):\n" +
                "свежие дрожжи: 1 ч.л. (5-10 грамм)\n" +
                "холодная вода: 300 мл\n" +
                "мелкий сахар: 0,5 ст.л.\n" +
                "соль: 1 ч.л.\n" +
                "оливковое масло: 1 ст.л.\n" +
                "пшеничная мука: ~ 600-700 мл (я всегда покупаю муку для пиццы, они доступны в специализированных магазинах итальянских продуктов или супермаркетах)\n" +
                "Для выпечки основы пиццы:\n" +
                "пшеничная мука: ~ 100 мл \n" +
                "бумага для выпечки\n" +
                "Пицца Capricciosa (получается 1 пицца диаметром около 30 см):\n" +
                "кусочков теста для классической пиццы: 1\n" +
                "тонкие ломтики вареной или копченой ветчины: 4  \n" +
                "шампиньоны: 5-6\n" +
                "маринованные артишоки: 2-3\n" +
                "соус для пиццы: 200 мл \n" +
                "тертый сыр: ~ 300 мл (я использую сыр моцарелла итальянского производства, порванный вручную)\n" +
                "оливки: 12-16 (лучше всего использовать черные оливки)\n" +
                "приправа для пиццы (я использую сушеный орегано, чтобы посыпать пиццу перед тем, как поставить ее в духовку)\n" +
                "\n" +
                "Рецепт приготовления\n" +
                "1. Примечание: В исходном рецепте не указывается, какие помидоры выбрать. Вы также можете использовать 2 небольшие банки томатов, консервированных в их соке, без кожицы и без добавок. В этот раз при приготовлении соуса я использовала помидоры из своей теплицы, поэтому я их очистила от кожуры и нашинковала - у меня получилось около 0,5 л. Я смешала красные и желтые помидоры, чтобы соус для пиццы стал ярко-оранжевым.\n" +
                "2. Соус для пиццы: Обжарьте лук в кастрюле с маслом около 5 минут, чтобы он изменил цвет.\n" +
                "3. Затем влить томатную пасту и жарить около 60 секунд.\n" +
                "4. Добавьте помидоры. Добавьте сахар, соль и уксус. Добавьте веточки базилика и варите соус на слабом огне около 45 минут, пока он не загустеет. Время от времени помешивайте.\n" +
                "5. Убираем и выбрасываем веточки базилика. Взбейте соус до получения однородной массы и вкуса.\n" +
                "6. Можно хранить в холодильнике 2-3 дня или в морозилке около месяца."

        const val FOUR_CHEESE_TITLE = "Четыре сыра"
        const val FOUR_CHEESE_DESCRIPTION = "Пицца четыре сыра — разновидность пиццы в итальянской кухне, покрытая комбинацией из четырёх видов сыра, обычно расплавленных вместе, с томатным соусом или без него."
        const val FOUR_CHEESE_RECIPE = "Вам понадобится:\n" +
                "\n" +
                "Мука – 300 гр;\n" +
                "Вода – 200 мл;\n" +
                "Сухие дрожжи – 5 гр;\n" +
                "Оливковое масло – 3 ст.л.;\n" +
                "Моцарелла – 100 гр;\n" +
                "Пармезан – 100 гр;\n" +
                "Горгонзола – 100 гр;\n" +
                "Эмменталь – 100 гр;\n" +
                "Листья базилика;\n" +
                "Соль, перец.\n" +
                "Приготовление:\n" +
                "\n" +
                "Муку просейте в глубокую миску и смешайте с дрожжами. Влейте туда же теплую воду, посолите и замесите мягкое, чуть липнущее к рукам тесто. В конце влейте оливковое масло.\n" +
                "Выложите тесто на поверхность, присыпанную мукой, и месите еще минимум 5 минут.\n" +
                "Из готового теста сформируйте шар, накройте его смоченным в горячей воде полотенцем и оставьте в теплом месте на 15 минут.\n" +
                "Отдохнувшее тесто раскатайте в тонкую лепешку. Выложите на противень.\n" +
                "Моцареллу, эмменталь и пармезан натрите отдельно на крупной терке. Горгонзолу разломайте пальцами.\n" +
                "Выложите на тесто сыры в такой последовательности: моцарелла, горгонзола, эмменталь. Сверху посыпьте пармезаном.\n" +
                "Выпекайте 15 минут при температуре 200 градусов. Готовую пиццу украсьте базиликом.  \n"

        const val HAWAIIAN_TITLE = "Гавайская"
        const val HAWAIIAN_DESCRIPTION = "Гавайская пицца — пицца, приготовляемая с использованием белого соуса, сыра, ананасов и курицы"
        const val HAWAIIAN_RECEPT = "Ингредиенты\n" +
                "Мука - 240–300 г\n" +
                "Дрожжи быстродействующие - 7–10 г\n" +
                "Соль- ¾ ч. ложки\n" +
                "Сахар - 1½ ч. ложки\n" +
                "Растительное масло - 3 ст. ложки + для смазывания\n" +
                "Вода - 160 мл\n" +
                "Ветчина - 120–150 г\n" +
                "Бекон - 4 ломтика\n" +
                "Консервированные ананасы - 200 г\n" +
                "Сыр - 150 г\n" +
                "Томатный соус - 3–5 ст. ложек\n" +
                "\n" +
                "Приготовление\n" +
                "1․Соедините 140 г муки с дрожжами, солью и сахаром. Влейте масло с тёплой водой и хорошо перемешайте.\n" +
                "2․Постепенно засыпайте оставшуюся муку, замешивая мягкое эластичное тесто.\n" +
                "Вам может понадобиться не вся мука, ориентируйтесь по консистенции теста.\n" +
                "3․Положите тесто в миску, накройте плёнкой или салфеткой и оставьте на 10 минут при комнатной температуре.\n" +
                "4․Ветчину и бекон нарежьте небольшими кусочками. Если ананасы кольцами, тоже порубите их. Сыр натрите на крупной тёрке.\n" +
                "5․Распределите тесто по смазанному маслом противню или форме. Диаметр основы для пиццы должен получиться примерно 30 см.\n" +
                "Предварительно слегка посыпьте руки мукой, чтобы тесто к ним не прилипало.\n" +
                "6․Смажьте основу соусом. Сверху выложите ветчину, бекон и ананасы, посыпьте тёртым сыром.\n" +
                "7․Запекайте 12–15 минут при температуре 230 °С."

        const val MARINARA_TITLE = "Маринара"
        const val MARINARA_DESCRIPTION = "Маринара - это неаполитанская пицца, приготовленная с простым и очень вкусным томатным соусом, который также подают и с другими блюдами."
        const val MARINARA_RECIPE = "Состав для теста (пицца диаметром 30 см):\n" +
                "\n" +
                "тёплая вода (120 грамм);\n" +
                "мука (180-200 грамм);\n" +
                "свежие дрожжи;\n" +
                "соль;\n" +
                "оливковое масло.\n" +
                "Состав для теста (пицца диаметром 30 см):\n" +
                "\n" +
                "тёплая вода (120 грамм);\n" +
                "мука (180-200 грамм);\n" +
                "свежие дрожжи;\n" +
                "соль;\n" +
                "оливковое масло.\n" +
                "Дополнительно (по желанию):\n" +
                "\n" +
                "пармезан (30-40 грамм);\n" +
                "маслины (7-10 штук).\n" +
                "Как поставить тесто?\n" +
                "\n" +
                "\n" +
                "В тёплую воду положить соль и раскрошенные дрожжи, перемешать.\n" +
                "Просеять муку и высыпать на стол в виде горки.\n" +
                "Сделать углубление по центру этой горки и туда потихоньку вливать дрожжи, растворённые в воде.\n" +
                "Подсыпать муку от краёв к центру.\n" +
                "Вымешивать снизу-вверх (примерно на протяжении десяти минут).\n" +
                "Когда полученное тесто становится мягким, сделать небольшое углубление и влить оливковое масло.\n" +
                "Снова тщательно вымешать, тесто не должно липнуть к рукам.\n" +
                "Скатать тесто в шар и положить в миску, дно миски должно быть смазано маслом, накрыть салфеткой или полотенцем, оставить на полтора-два часа, чтобы оно поднялось.\n" +
                "После того, как тесто поднялось, растянуть его в лепёшку, примерно 5 миллиметров толщиной.\n" +
                "Полученную лепёшку выложить на форму для запекания, форма предварительно должна быть смазана оливковым маслом.\n" +
                "Тесто нужно в нескольких местах наколоть вилкой.\n" +
                "Накрыть салфеткой или полотенцем и ещё дать постоять минут десять – пятнадцать.\n" +
                "Как готовится соус?\n" +
                "Мпелые помидоры обдать кипятком и снять с них кожицу.\n" +
                "Разрезать томаты, очистить их.\n" +
                "Порубить мякоть ножом.\n" +
                "Натереть чеснок.\n" +
                "Добавить в томаты натёртый чеснок, травы, соль, половину ложки сахара, соль, аккуратно перемешать.\n" +
                "Важно: соус не должен получиться жидким. Если вышло много жидкости, следует немного подождать, пока соус осядет и слить лишнюю жидкость.\n" +
                "\n" +
                "Приготовление самой пиццы:\n" +
                "\n" +
                "Тесто, выложенное на форму, смазать соусом.\n" +
                "Нарезать пару зубчиков чеснока тоненькими пластинами и выложить на соус.\n" +
                "Присыпать сухим орегано.\n" +
                "Маслины без косточек нарезать пополам, также положить поверх соуса.\n" +
                "Присыпать тёртым пармезаном (желательно ближе к краям, чтобы в центре был только соус).\n" +
                "Сбрызнуть пиццу оливковым маслом, поставить в духовку, температура выпекания – 200 градусов, время – примерно 20 минут.\n" +
                "Украсить готовую пиццу листиками базилика.\n"

        const val NEAPOLITANA_TITLE = "Неаполитанская"
        const val NEAPOLITANA_DESCRIPTION = "Главным отличием неаполитанской пиццы является её основа, диаметр которой составляет приблизительно 25 с половиной сантиметров. Классическая неаполитанская пицца небольшая по размеру и тонкая в середине, зато толстая с краёв."
        const val NEAPOLITANA_RECIPE = "Ингредиенты\n" +
                "Пшеничная мука высшего сорта - 285 г\n" +
                "Быстродействующие дрожжи - 8 гр.\n" +
                "Соль - 1,5 ч.л.\n" +
                "Холодная вода - 185 мл\n" +
                "Целые очищенные томаты - 300 г\n" +
                "Сыр моцарелла - 170 г\n" +
                "Свежий базилик - по вкусу\n" +
                "Смесь муки и манной крупы - по необходимости\n" +
                "Оливковое масло - по необходимости\n" +
                "\n" +
                "Приготовление\n" +
                "Поместите 285 г муки, 1 ч.л. соли и дрожжи в чашу миксера. Перемешайте ингредиенты.\n" +
                "Добавьте воду и замесите тесто на низкой скорости в течение 5-6 минут, пока оно не станет гладким и эластичным.\n" +
                "Накройте чашу пищевой плёнкой и дайте тесту подняться за 45-60 минут.\n" +
                "Посыпьте противень смесью манной крупы и муки.\n" +
                "Разделите тесто на 2 шара и положите их на противень на расстоянии не менее 10 см. Слегка смажьте оливковым маслом верхнюю часть каждого шара. Оберните противень пищевой плёнкой и уберите в холодильник.\n" +
                "Храните тесто в холодильнике от 6 часов до 4 дней.\n" +
                "Достаньте тесто из холодильника и подержите его при комнатной температуре 1 час.\n" +
                "Подготовьте соус для пиццы: измельчите томаты в блендере, добавьте 0,5 ч.л. соли.\n" +
                "За 20 минут до готовности теста разогрейте печь, выбрав программу .\n" +
                "Посыпьте рабочую поверхность смесью из муки и манной крупы. Положите на неё тесто и сформируйте шар.\n" +
                "Руками раскатайте из теста основу для пиццы диаметром 25-30 см. Растягивайте тесто сначала пальцами, а затем ладонями. Не используйте механический способ раскатки, чтобы сохранить пористую структуру.\n" +
                "Посыпьте лопатку смесью муки и манной крупы. Аккуратно поместите на неё основу для пиццы.\n" +
                "Равномерно распределите соус по основе, оставляя чистыми 1-2 см по краям.\n" +
                "Выложите сыр моцарелла и украсьте несколькими листьями базилика.\n" +
                "Поместите пиццу в печь и включите таймер. Через 2 минуты пицца будет готова.\n" +
                "Сбрызните пиццу оливковым маслом, переложите на разделочную доску, нарежьте и подавайте."

        const val SEA_TITLE = "Морская"
        const val SEA_DESCRIPTION = "Морская пицца получается очень сочной, нежной и довольно легкой, ведь в ее составе нет мяса, птицы или колбасы."
        const val SEA_RECIPE = "Ингредиенты\n" +
                "1 стакан пшеничной муки высшего сорта;\n" +
                "3 г сухих дрожжей;\n" +
                "1/4 ч. л. соли;\n" +
                "одна ч. л. сахарного песка;\n" +
                "1-2 ст. л. оливкового масла;\n" +
                "80-85 мл воды.\n" +
                "\n" +
                "Пошаговый рецепт основы в домашних условиях:\n" +
                "Муку необходимо просеять через сито.\n" +
                "Добавить к ней дрожжи, соль и сахарный песок.\n" +
                "Тщательно все перемешать.\n" +
                "Воду подогреть в микроволновой печи в течение 10-12 секунд. Влить в нее оливковое масло и размешать.\n" +
                "Добавить воду с маслом в муку и хорошо перемешать.\n" +
                "Вымесить тесто. По чуть-чуть добавлять муку до тех пор, пока она перестанет прилипать к рукам.\n" +
                "Слепить из теста шар и положить его в миску. Прикрыть тканевой салфеткой.\n" +
                "Оставить в тёплом месте на 40-45 минут.\n" +
                "СПРАВКА: Тесто должно быть мягким и эластичным, отлично тянуться.\n" +
                "\n" +
                "Как только тесто поднимется, подмесить его и растянуть руками в лепёшку слоем в 5-7 миллиметров.\n" +
                "Помазать форму для пиццы маслом и уложить в неё тесто.\n" +
                "Дать тесту подняться.\n" +
                "\n" +
                "Что входит в состав сливочного соуса?\n" +
                "70 гр сыра;\n" +
                "20 гр сливочного масла;\n" +
                "170 мл молока;\n" +
                "1 яйцо;\n" +
                "20 гр пшеничной муки;\n" +
                "чёрный молотый перец и соль по вкусу.\n" +
                "\n" +
                "Как приготовить дома?\n" +
                "В глубокую сковородку высыпать муку и поставить её на плиту.\n" +
                "Подсушить до золотистого оттенка. Добавить чёрного перца и морской соли.\n" +
                "Тоненькой струйкой, не прекращая мешать, влить молоко.\n" +
                "Довести до кипения и взбить блендером.\n" +
                "Отдельно взбить миксером яйца, добавить натёртый сыр и растопленное масло.\n" +
                "Соединить все ингредиенты.\n" +
                "\n" +
                "Лучшая начинка с креветками, помидорами и морским гребешком\n" +
                "200 гр теста;\n" +
                "белый соус;\n" +
                "150-200 гр смеси морепродуктов с креветками и морским гребешком;\n" +
                "1 ст. л. виноградного уксуса;\n" +
                "1 помидор;\n" +
                "сыр моцарелла — 70 гр;\n" +
                "1 луковица;\n" +
                "сыр пармезан —  10 гр;\n" +
                "орегано.\n" +
                "\n" +
                "Начинаем готовить в духовке\n" +
                "Отварить свежие морепродукты в течение 2-3 минуты.\n" +
                "Лук порезать тоненькой соломкой и замариновать в виноградном уксусе.\n" +
                "ВНИМАНИЕ: для быстрого маринования добавить стакан кипятка, спустя пять минут ополоснуть лук водой и отжать.\n" +
                "\n" +
                "Смазать тесто белым соусом.\n" +
                "Выложить равномерным слоем начинку из морепродуктов и посыпать сухим орегано.\n" +
                "СПРАВКА: купленный в магазине варено-мороженый «морской коктейль» нужно лишь разморозить и нарезать крупными кусочками.\n" +
                "\n" +
                "Помидор порезать тоненькими кружочками.\n" +
                "СПРАВКА: чтобы удалить шкурку, достаточно обдать помидор кипятком.\n" +
                "\n" +
                "Уложить помидорные кружочки на пиццу.\n" +
                "Равномерно разместить маринованный лук.\n" +
                "Порезать моцареллу тоненькими ломтиками и уложить равномерным слоем.\n" +
                "Натереть пармезан на мелкой тёрке и посыпать сверху.\n" +
                "Поместить пиццу в предварительно разогретую до 200 градусов духовку. Время выпекания — 20 минут.\n"
    }
}